RT-Thread/rt-thread/bsp/imxrt/imxrt1052-sc-internal/board/MCUX_Config/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_FlexSPI_D2_B_GPIO                                   GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_FlexSPI_D2_B_GPIO_PIN                                  1U   /*!< GPIO pin number */
#define BOARD_INITPINS_FlexSPI_D2_B_GPIO_PIN_MASK                     (1U << 1U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_FlexSPI_D2_B_PORT                                   GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_FlexSPI_D2_B_PIN                                       1U   /*!< PORT pin number */
#define BOARD_INITPINS_FlexSPI_D2_B_PIN_MASK                          (1U << 1U)   /*!< PORT pin mask */

/* GPIO_AD_B1_15 (coord J14), SAI1_TX_SYNC/CSI_D2/J35[6]/U13[13] */
/* Routed pin properties */
#define BOARD_INITPINS_CSI_D2_PERIPHERAL                                     CSI   /*!< Peripheral name */
#define BOARD_INITPINS_CSI_D2_SIGNAL                                    csi_data   /*!< Signal name */
#define BOARD_INITPINS_CSI_D2_CHANNEL                                         2U   /*!< Signal channel */

/* GPIO_AD_B1_14 (coord G12), SAI1_TX_BCLK/CSI_D3/J35[4]/U13[12] */
/* Routed pin properties */
#define BOARD_INITPINS_CSI_D3_PERIPHERAL                                     CSI   /*!< Peripheral name */
#define BOARD_INITPINS_CSI_D3_SIGNAL                                    csi_data   /*!< Signal name */
#define BOARD_INITPINS_CSI_D3_CHANNEL                                         3U   /*!< Signal channel */

/* GPIO_AD_B1_13 (coord H11), SAI1_TXD/CSI_D4/J35[3]/U13[14] */
/* Routed pin properties */
#define BOARD_INITPINS_CSI_D4_PERIPHERAL                                     CSI   /*!< Peripheral name */
#define BOARD_INITPINS_CSI_D4_SIGNAL                                    csi_data   /*!< Signal name */
#define BOARD_INITPINS_CSI_D4_CHANNEL                                         4U   /*!< Signal channel */

/* GPIO_AD_B1_12 (coord H12), SAI1_RXD/CSI_D5/J35[5]/U13[16] */
/* Routed pin properties */
#define BOARD_INITPINS_CSI_D5_PERIPHERAL                                     CSI   /*!< Peripheral name */
#define BOARD_INITPINS_CSI_D5_SIGNAL                                    csi_data   /*!< Signal name */
#define BOARD_INITPINS_CSI_D5_CHANNEL                                         5U   /*!< Signal channel */

/* GPIO_AD_B1_11 (coord J13), BSP_DS18B20 */
/* Routed pin properties */
#define BOARD_INITPINS_CSI_D6_PERIPHERAL                                     CSI   /*!< Peripheral name */
#define BOARD_INITPINS_CSI_D6_SIGNAL                                    csi_data   /*!< Signal name */
#define BOARD_INITPINS_CSI_D6_CHANNEL                                         6U   /*!< Signal channel */

/* GPIO_AD_B1_10 (coord L13), BSP_RS485_RE */
/* Routed pin properties */
#define BOARD_INITPINS_CSI_D7_PERIPHERAL                                     CSI   /*!< Peripheral name */
#define BOARD_INITPINS_CSI_D7_SIGNAL                                    csi_data   /*!< Signal name */
#define BOARD_INITPINS_CSI_D7_CHANNEL                                         7U   /*!< Signal channel */

/* GPIO_AD_B1_09 (coord M13), SAI1_MCLK/CSI_D8/J35[11] */
/* Routed pin properties */
#define BOARD_INITPINS_CSI_D8_PERIPHERAL                                     CSI   /*!< Peripheral name */
#define BOARD_INITPINS_CSI_D8_SIGNAL                                    csi_data   /*!< Signal name */
#define BOARD_INITPINS_CSI_D8_CHANNEL                                         8U   /*!< Signal channel */

/* GPIO_AD_B1_08 (coord H13), AUD_INT/CSI_D9//J35[13]/J22[4] */
/* Routed pin properties */
#define BOARD_INITPINS_CSI_D9_PERIPHERAL                                     CSI   /*!< Peripheral name */
#define BOARD_INITPINS_CSI_D9_SIGNAL                                    csi_data   /*!< Signal name */
#define BOARD_INITPINS_CSI_D9_CHANNEL                                         9U   /*!< Signal channel */

/* GPIO_AD_B1_04 (coord L12), CSI_PIXCLK/J35[8]/J23[3] */
/* Routed pin properties */
#define BOARD_INITPINS_CSI_PIXCLK_PERIPHERAL                                 CSI   /*!< Peripheral name */
#define BOARD_INITPINS_CSI_PIXCLK_SIGNAL                              csi_pixclk   /*!< Signal name */

/* GPIO_AD_B1_07 (coord K10), CSI_HSYNC/J35[16]/J22[1]/UART_RX */
/* Routed pin properties */
#define BOARD_INITPINS_CSI_HSYNC_PERIPHERAL                                  CSI   /*!< Peripheral name */
#define BOARD_INITPINS_CSI_HSYNC_SIGNAL                                csi_hsync   /*!< Signal name */

/* GPIO_AD_B1_06 (coord J12), CSI_VSYNC/J35[18]/J22[2]/UART_TX */
/* Routed pin properties */
#define BOARD_INITPINS_CSI_VSYNC_PERIPHERAL                                  CSI   /*!< Peripheral name */
#define BOARD_INITPINS_CSI_VSYNC_SIGNAL                                csi_vsync   /*!< Signal name */

/* GPIO_AD_B0_14 (coord H14), CAN2_TX/U12[1] */
/* Routed pin properties */
#define BOARD_INITPINS_CAN2_TX_PERIPHERAL                                   ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_CAN2_TX_SIGNAL                                         IN   /*!< Signal name */
#define BOARD_INITPINS_CAN2_TX_CHANNEL                                        3U   /*!< Signal channel */

/* GPIO_AD_B1_03 (coord M12), SPDIF_IN/J22[8] */
/* Routed pin properties */
#define BOARD_INITPINS_SPDIF_IN_PERIPHERAL                                  ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_SPDIF_IN_SIGNAL                                        IN   /*!< Signal name */
#define BOARD_INITPINS_SPDIF_IN_CHANNEL                                       8U   /*!< Signal channel */

/* GPIO_AD_B1_02 (coord L11), SPDIF_OUT/J22[7] */
/* Routed pin properties */
#define BOARD_INITPINS_SPDIF_OUT_PERIPHERAL                                 ADC1   /*!< Peripheral name */
#define BOARD_INITPINS_SPDIF_OUT_SIGNAL                                       IN   /*!< Signal name */
#define BOARD_INITPINS_SPDIF_OUT_CHANNEL                                      7U   /*!< Signal channel */

/* GPIO_B1_08 (coord A12), ENET_TXD1 */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_TXD1_PERIPHERAL                                GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_TXD1_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ENET_TXD1_CHANNEL                                     24U   /*!< Signal channel */

