RT-Thread/rt-thread/bsp/imxrt/imxrt1052-sc-internal/board/MCUX_Config/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ENET_TXD1_GPIO                                      GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ENET_TXD1_GPIO_PIN                                    24U   /*!< GPIO pin number */
#define BOARD_INITPINS_ENET_TXD1_GPIO_PIN_MASK                       (1U << 24U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ENET_TXD1_PORT                                      GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ENET_TXD1_PIN                                         24U   /*!< PORT pin number */
#define BOARD_INITPINS_ENET_TXD1_PIN_MASK                            (1U << 24U)   /*!< PORT pin mask */

/* GPIO_B1_07 (coord B12), ENET_TXD0 */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_TXD0_PERIPHERAL                                GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_TXD0_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ENET_TXD0_CHANNEL                                     23U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ENET_TXD0_GPIO                                      GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ENET_TXD0_GPIO_PIN                                    23U   /*!< GPIO pin number */
#define BOARD_INITPINS_ENET_TXD0_GPIO_PIN_MASK                       (1U << 23U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ENET_TXD0_PORT                                      GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ENET_TXD0_PIN                                         23U   /*!< PORT pin number */
#define BOARD_INITPINS_ENET_TXD0_PIN_MASK                            (1U << 23U)   /*!< PORT pin mask */

/* GPIO_B1_09 (coord A13), ENET_TXEN */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_TXEN_PERIPHERAL                                GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_TXEN_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ENET_TXEN_CHANNEL                                     25U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ENET_TXEN_GPIO                                      GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ENET_TXEN_GPIO_PIN                                    25U   /*!< GPIO pin number */
#define BOARD_INITPINS_ENET_TXEN_GPIO_PIN_MASK                       (1U << 25U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ENET_TXEN_PORT                                      GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ENET_TXEN_PIN                                         25U   /*!< PORT pin number */
#define BOARD_INITPINS_ENET_TXEN_PIN_MASK                            (1U << 25U)   /*!< PORT pin mask */

/* GPIO_B0_06 (coord A8), LCDIF_D2/BT_CFG[2] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D2_PERIPHERAL                                  PWM2   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D2_SIGNAL                                         A   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D2_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_B0_07 (coord A9), LCDIF_D3/BT_CFG[3] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D3_PERIPHERAL                                  PWM2   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D3_SIGNAL                                         B   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D3_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_B0_08 (coord B9), LCDIF_D4/BT_CFG[4] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D4_PERIPHERAL                                  PWM2   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D4_SIGNAL                                         A   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D4_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_B0_09 (coord C9), LCDIF_D5/BT_CFG[5] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D5_PERIPHERAL                                  PWM2   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D5_SIGNAL                                         B   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D5_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_B0_10 (coord D9), LCDIF_D6/BT_CFG[6] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D6_PERIPHERAL                                  PWM2   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D6_SIGNAL                                         A   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D6_CHANNEL                                       2U   /*!< Signal channel */

/* GPIO_B0_12 (coord C10), LCDIF_D8/BT_CFG[8] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D8_PERIPHERAL                                 GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D8_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D8_CHANNEL                                      12U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LCDIF_D8_GPIO                                       GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LCDIF_D8_GPIO_PIN                                     12U   /*!< GPIO pin number */
#define BOARD_INITPINS_LCDIF_D8_GPIO_PIN_MASK                        (1U << 12U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_LCDIF_D8_PORT                                       GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_LCDIF_D8_PIN                                          12U   /*!< PORT pin number */
#define BOARD_INITPINS_LCDIF_D8_PIN_MASK                             (1U << 12U)   /*!< PORT pin mask */

/* GPIO_B1_10 (coord B13), ENET_TX_CLK */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_TX_CLK_PERIPHERAL                              GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_TX_CLK_SIGNAL                                gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ENET_TX_CLK_CHANNEL                                   26U   /*!< Signal channel */

