RT-Thread/rt-thread/bsp/imxrt/imxrt1052-sc-internal/board/MCUX_Config/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ENET_TX_CLK_GPIO                                    GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ENET_TX_CLK_GPIO_PIN                                  26U   /*!< GPIO pin number */
#define BOARD_INITPINS_ENET_TX_CLK_GPIO_PIN_MASK                     (1U << 26U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ENET_TX_CLK_PORT                                    GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ENET_TX_CLK_PIN                                       26U   /*!< PORT pin number */
#define BOARD_INITPINS_ENET_TX_CLK_PIN_MASK                          (1U << 26U)   /*!< PORT pin mask */

/* GPIO_B0_01 (coord E7), LCDIF_ENABLE */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_ENABLE_PERIPHERAL                            LPSPI4   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_ENABLE_SIGNAL                                   SDI   /*!< Signal name */

/* GPIO_B0_02 (coord E8), LCDIF_HSYNC */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_HSYNC_PERIPHERAL                             LPSPI4   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_HSYNC_SIGNAL                                    SDO   /*!< Signal name */

/* GPIO_B0_03 (coord D8), LCDIF_VSYNC */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_VSYNC_PERIPHERAL                             LPSPI4   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_VSYNC_SIGNAL                                    SCK   /*!< Signal name */

/* GPIO_B0_00 (coord D7), LCDIF_CLK */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_CLK_PERIPHERAL                               LPSPI4   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_CLK_SIGNAL                                     PCS0   /*!< Signal name */

/* GPIO_B1_03 (coord D11), LCDIF_D15 */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D15_PERIPHERAL                               LPSPI4   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D15_SIGNAL                                     PCS1   /*!< Signal name */

/* GPIO_B1_02 (coord C11), LCDIF_D14 */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D14_PERIPHERAL                               LPSPI4   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D14_SIGNAL                                     PCS2   /*!< Signal name */

/* GPIO_B1_11 (coord C13), ENET_RXER */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RXER_PERIPHERAL                                GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RXER_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ENET_RXER_CHANNEL                                     27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ENET_RXER_GPIO                                      GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ENET_RXER_GPIO_PIN                                    27U   /*!< GPIO pin number */
#define BOARD_INITPINS_ENET_RXER_GPIO_PIN_MASK                       (1U << 27U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ENET_RXER_PORT                                      GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ENET_RXER_PIN                                         27U   /*!< PORT pin number */
#define BOARD_INITPINS_ENET_RXER_PIN_MASK                            (1U << 27U)   /*!< PORT pin mask */

/* GPIO_B1_06 (coord C12), ENET_CRS_DV */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_CRS_DV_PERIPHERAL                              GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_CRS_DV_SIGNAL                                gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ENET_CRS_DV_CHANNEL                                   22U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ENET_CRS_DV_GPIO                                    GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ENET_CRS_DV_GPIO_PIN                                  22U   /*!< GPIO pin number */
#define BOARD_INITPINS_ENET_CRS_DV_GPIO_PIN_MASK                     (1U << 22U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ENET_CRS_DV_PORT                                    GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ENET_CRS_DV_PIN                                       22U   /*!< PORT pin number */
#define BOARD_INITPINS_ENET_CRS_DV_PIN_MASK                          (1U << 22U)   /*!< PORT pin mask */

/* GPIO_B1_04 (coord E12), ENET_RXD0 */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RXD0_PERIPHERAL                                GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RXD0_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ENET_RXD0_CHANNEL                                     20U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ENET_RXD0_GPIO                                      GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ENET_RXD0_GPIO_PIN                                    20U   /*!< GPIO pin number */
#define BOARD_INITPINS_ENET_RXD0_GPIO_PIN_MASK                       (1U << 20U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ENET_RXD0_PORT                                      GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ENET_RXD0_PIN                                         20U   /*!< PORT pin number */
#define BOARD_INITPINS_ENET_RXD0_PIN_MASK                            (1U << 20U)   /*!< PORT pin mask */

/* GPIO_B1_05 (coord D12), ENET_RXD1 */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_RXD1_PERIPHERAL                                GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_RXD1_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ENET_RXD1_CHANNEL                                     21U   /*!< Signal channel */

