RT-Thread/rt-thread/bsp/imxrt/imxrt1052-sc-internal/board/MCUX_Config/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ENET_RXD1_GPIO                                      GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ENET_RXD1_GPIO_PIN                                    21U   /*!< GPIO pin number */
#define BOARD_INITPINS_ENET_RXD1_GPIO_PIN_MASK                       (1U << 21U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ENET_RXD1_PORT                                      GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ENET_RXD1_PIN                                         21U   /*!< PORT pin number */
#define BOARD_INITPINS_ENET_RXD1_PIN_MASK                            (1U << 21U)   /*!< PORT pin mask */

/* GPIO_B0_13 (coord D10), LCDIF_D9/BT_CFG[9] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D9_PERIPHERAL                                  ENC1   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D9_SIGNAL                                     PHASE   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D9_CHANNEL                                        A   /*!< Signal channel */

/* GPIO_B0_14 (coord E10), LCDIF_D10/BT_CFG[10] */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D10_PERIPHERAL                                 ENC1   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D10_SIGNAL                                    PHASE   /*!< Signal name */
#define BOARD_INITPINS_LCDIF_D10_CHANNEL                                       B   /*!< Signal channel */

/* GPIO_B1_00 (coord A11), LCDIF_D12 */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D12_PERIPHERAL                              LPUART4   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D12_SIGNAL                                       TX   /*!< Signal name */

/* GPIO_B1_01 (coord B11), LCDIF_D13 */
/* Routed pin properties */
#define BOARD_INITPINS_LCDIF_D13_PERIPHERAL                              LPUART4   /*!< Peripheral name */
#define BOARD_INITPINS_LCDIF_D13_SIGNAL                                       RX   /*!< Signal name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
